{
  "posts": [
    {
      "id": "1",
      "question": "What are the features of React? ",
      "ans": "It uses the virtual DOM instead of the real DOM, server-side rendering, uni-directional data flow or data binding."
    },
    {
      "id": "2",
      "question": "What is JSX?",
      "ans": "JSX is a shorthand for JavaScript XML. This is a type of file used by React which utilizes the expressiveness of JavaScript along with HTML like template syntax. This makes the HTML file really easy to understand. This file makes applications robust and boosts its performance."
    },
    {
      "id": "3",
      "question": "What is Props?",
      "ans": "2Props is the shorthand for Properties in React. They are read-only components which must be kept pure i.e. immutable. They are always passed down from the parent to the child components throughout the application. A child component can never send a prop back to the parent component. This help in maintaining the unidirectional data flow and are generally used to render the dynamically generated data.00"
    },
    {
      "id": "6",
      "question": "What is a state in React?",
      "ans": "The state is a built-in React object that is used to contain data or information about the component. The state in a component can change over time, and whenever it changes, the component re-renders.The change in state can happen as a response to user action or system-generated events. It determines the behavior of the component and how it will render."
    },
    {
      "id": "4",
      "question": "What is an arrow function and how is it used in React?",
      "ans": "An arrow function is a short way of writing a function to React.It is unnecessary to bind ‘this’ inside the constructor when using an arrow function. This prevents bugs caused by the use of ‘this’ in React callbacks."
    },
    {
      "id": "5",
      "question": "What are the components in React?",
      "ans": "Components are the building blocks of any React application, and a single app usually consists of multiple components. A component is essentially a piece of the user interface. It splits the user interface into independent, reusable parts that can be processed separately.Functional Components: These types of components have no state of their own and only contain render methods, and therefore are also called stateless components. They may derive data from other components as props (properties).Class Components: These types of components can hold and manage their own state and have a separate render method to return JSX on the screen. They are also called Stateful components as they can have a state."
    }
  ]
}
